{
	"open_project" : [
		{
			"id" : "fluiric",
			"name" : "Fluiric",
			"type" : "Desktop",
			"language" : [{
				"name" : "Swift",
				"color" : "#000000",
				"value" : "100"
			}],
			"main_photo" : "/img/fluiric.png",
			"thumb_photo" : "/img/fluiric.png"
		},
		{
			"id" : "panda",
			"name" : "Panda",
			"type" : "Mobile",
			"language" : [{
				"name" : "Dart",
				"color" : "#000000",
				"value" : "100"
			}],
			"main_photo" : "/img/panda_thumbnail.png",
			"thumb_photo" : "/img/panda_thumbnail.png"
		},
		{
			"id" : "todo",
			"name" : "Todo",
			"type" : "Mobile",
			"language" : [{
				"name" : "Dart",
				"color" : "#000000",
				"value" : "100"
			}],
			"main_photo" : "/img/todo_thumbnail.png",
			"thumb_photo" : "/img/todo_thumbnail.png"
		},
		{
			"id" : "hava",
			"name" : "Hava",
			"type" : "Mobile",
			"language" : [{
				"name" : "Dart",
				"color" : "#000000",
				"value" : "100"
			}],
			"main_photo" : "/img/hava_app_ui.png",
			"thumb_photo" : "/img/hava_app_ui.png"
		},
		{
			"id" : "qtz",
			"name" : "QTZ",
			"type" : "Mobile",
			"language" : [{
				"name" : "Dart",
				"color" : "#000000",
				"value" : "100"
			}],
			"main_photo" : "/img/qtz_app_ui.png",
			"thumb_photo" : "/img/qtz_app_ui.png"
		},
		{
			"id" : "ipod",
			"name" : "Ipod",
			"type" : "Mobile",
			"language" : [{
				"name" : "Dart",
				"color" : "#000000",
				"value" : "100"
			}],
			"main_photo" : "/img/ipod.png",
			"thumb_photo" : "/img/ipod.png"
		},
		{
			"id" : "minerva",
			"name" : "Minerva",
			"type" : "Mobile",
			"language" : [{
				"name" : "Dart",
				"color" : "#000000",
				"value" : "100"
			}],
			"main_photo" : "/img/minerva_app_ui.png",
			"thumb_photo" : "/img/minerva_app_ui.png"
		},
		{
			"id" : "quran_go",
			"name" : "Rest API Al Quran",
			"type" : "Other",
			"language" : [{
				"name" : "Go",
				"color" : "#000000",
				"value" : "100"
			}],
			"main_photo" : "/img/quran_go.png",
			"thumb_photo" : "/img/quran_go.png"
		},
		{
			"id" : "wordseeker",
			"name" : "WordSeeker",
			"type" : "Web",
			"language" : [{
				"name" : "Dart",
				"color" : "#000000",
				"value" : "100"
			}],
			"main_photo" : "/img/wordseeker_ui_puzzle.png",
			"thumb_photo" : "/img/wordseeker_ui_puzzle.png"
		},
		{
			"id" : "snaptify",
			"name" : "Snaptify",
			"type" : "Web",
			"language" : [{
				"name" : "Dart",
				"color" : "#000000",
				"value" : "100"
			}],
			"main_photo" : "/img/snaptify.png",
			"thumb_photo" : "/img/snaptify.png"
		},
		{
			"id" : "flagly",
			"name" : "Flagly",
			"type" : "Web",
			"language" : [{
				"name" : "Dart",
				"color" : "#000000",
				"value" : "100"
			}],
			"main_photo" : "/img/flagly.png",
			"thumb_photo" : "/img/flagly.png"
		}

	],
	"professional_project": [
		
	{
		"id": "smartkorlantas",
		"name" : "Smart Korlantas",
		"client" : {
			"type_client": "fulltime",
			"name": "PT Traspac Makmur Sejahtera",
			"url" : "https://www.traspac.co.id"
		},
		"type" : "Mobile",
		"language" : [{
			"name" : "Flutter",
			"color" : "#000000",
			"value" : "100"
		}],
		"date_start" : "Oktober 2024",
		"date_end" : "Present",
		"live_url" : "",
		"thumb_photo": "/img/smartkorlantas-1.png",
		"photo" : [
			"/img/smartkorlantas-1.png",
			"/img/smartkorlantas-2.png"
		],
		"contribution" : [
			"Structured the project layout, establishing organized folders and code architecture.",
			"Developed the foundational setup for state management using BLoC.",
			"Integrated Dio for reliable HTTP client functionality.",
			"Configured application routing and dependency injection, enhancing scalability and maintainability.",
			"Created a custom code generator that automates the creation of pages and modules, accelerating development and simplifying feature addition for the team.",
			"Actively collaborated with other mobile developers, fostering an efficient development environment."
		],
		"description" : "Smart Korlantas is a SuperApp developed to consolidate all Korlantas POLRI services into a single, user-friendly application. Designed to streamline traffic-related services across Indonesia, the app provides a comprehensive platform for users to manage and access essential services efficiently. From traffic information to various Korlantas services, Smart Korlantas offers a seamless experience that simplifies complex processes and reduces the need for multiple platforms. Built using Flutter, this mobile solution is optimized to deliver smooth performance tailored to Indonesia’s specific needs."
	} , 
	
	{
		"id": "bungkus",
		"name" : "Bungkus",
		"client" : {
			"type_client": "freelance",
			"name": "Bungkus",
			"url" : "https://bungkus.co.id"
		},
		"type" : "Web",
		"language" : [{
			"name" : "Next JS",
			"color" : "#000000",
			"value" : "40"
		},{
			"name" : "Tailwind CSS",
			"color" : "#000000",
			"value" : "10"
		},{
			"name" : "Golang (Gin)",
			"color" : "#000000",
			"value" : "40"
		},{
			"name" : "PostgreSQL",
			"color" : "#000000",
			"value" : "10"
		}],
		"date" : "2024-10-05",
		"live_url" : "https://bungkus.co.id",
		"thumb_photo": "/img/bungkus-1.png",
		"photo" : [
			"/img/bungkus-1.png",
			"/img/bungkus-2.png",
			"/img/bungkus-3.png"
		],
		"contribution" : [
			
			"Designed and developed the front-end of the Bungkus app using Next.js, ensuring that client specifications were met with high-quality and scalable solutions.",
			"Collaborated closely with the client to gather detailed project requirements, providing technical insights to enhance functionality and user experience.",
			"Built a responsive and user-friendly web application that leverages modern design principles, ensuring an intuitive user experience that meets the needs of dropshipping sellers.",
			"Implemented the back-end functionality using Golang, ensuring robust performance, efficient data handling, and seamless integration with the front-end.",
			"Managed the server setup and configuration, preparing the web server for deployment and optimizing it for performance and security.",
			"Handled domain configuration to facilitate seamless access to the application, enhancing user experience from the outset.",
			"Maintained clear and consistent communication with the client throughout the project, ensuring alignment with project goals and deliverables.",
			"Provided ongoing support for bug fixes and error resolution for four months after project handover, continuously implementing updates and enhancements based on client feedback and user testing to ensure the application remained effective and user-centric."

		],
		"description" : "Bungkus is an app designed for managing goods and transactions within a dropshipping business. This application features transaction management capabilities that streamline the process from the dropshipper seller to the warehouse and ultimately to the customer. Bungkus facilitates dropshipping sellers by simplifying their operations, eliminating the need for repackaging and shipping products directly to customers. By bridging the gaps between sellers, warehouses, and customers, the app enhances the efficiency of the dropshipping process. Additionally, Bungkus assists sellers in managing the inventory they store in the warehouse. The concept for this app was inspired by Crewdible."
	}  ,
	{
		"id": "pwni",
		"name" : "Portal Peduli WNI (PWNi)",
		"client" : {
			"type_client": "fulltime",
			"name": "PT Traspac Makmur Sejahtera | Client : Kementerian Luar Negeri",
			"url" : "https://www.traspac.co.id"
		},
		"type" : "Web",
		"language" : [{
			"name" : "JS (JQuery)",
			"color" : "#000000",
			"value" : "40"
		},{
			"name" : "CSS (Bootstrap)",
			"color" : "#000000",
			"value" : "20"
		},{
			"name" : "PHP ",
			"color" : "#000000",
			"value" : "40"
		}],
		"date_start" : "Oktober 2019",
		"date_end" : "Oktober 2022",
		"live_url" : "https://peduliwni.kemlu.go.id",
		"thumb_photo": "/img/pwni.png",
		"photo" : [
			"/img/pwni.png",
			"/img/pwni-1.png"
		],
		"contribution" : [
			"Developed and maintained the PEDULI WNI portal using web technologies to support Indonesian citizens abroad in accessing essential services.",
			"Collaborated closely with Quality Control (QC) and client teams to identify, verify, and resolve reported bugs, enhancing the platform's stability and reliability.",
			"Added new features and menus as requested by clients, ensuring the application aligns with user needs and improves overall functionality.",
			"Actively participated in the full development lifecycle, from planning and design to deployment, contributing to both front-end and back-end aspects of the project.",
			"Provided continuous support for the live application, monitoring performance and promptly addressing issues to maintain optimal user experience."
		],
		"description" : "PEDULI WNI is a service and protection portal designed for Indonesian citizens (WNI) residing abroad, managed by the Ministry of Foreign Affairs (Kemenlu). The platform facilitates WNI data collection through a 'lapor diri' feature, making it easier for citizens to request various services, either online or by booking appointments for in-person visits at Indonesian consulates. The portal also allows WNI to submit complaints independently through the application."
	} ,
	{
		"id": "komcad",
		"name" : "Komcad",
		"client" : {
			"type_client": "fulltime",
			"name": "PT Traspac Makmur Sejahtera | Client : Kementerian Pertahanan",
			"url" : "https://www.traspac.co.id"
		},
		"type" : "Web",
		"language" : [{
			"name" : "Nuxt JS",
			"color" : "#000000",
			"value" : "100"
		}],
		"date_start" : "Oktober 2023",
		"date_end" : "Sekarang",
		"live_url" : "https://komcad.kemhan.go.id",
		"thumb_photo": "/img/komcad.png",
		"photo" : [
			"/img/komcad.png",
			"/img/komcad-1.png"
		],
		"contribution" : [
			"Developed and maintained the front-end of the Web Komcad recruitment website using Nuxt.js to create a responsive and user-friendly interface.",
			"Collaborated with cross-functional teams to address and resolve bugs reported by the QA team, ensuring the stability and reliability of the website.",
			"Implemented new features and enhancements to improve user experience and meet project specifications, focusing on intuitive navigation and accessibility.",
			"Provided ongoing support for the live website, monitoring performance and resolving issues to ensure optimal operation and user satisfaction."
		],
		"description" : "Web Komcad is a recruitment website designed for the selection process of Komcad (Komponen Cadangan) personnel by the Ministry of Defense. This platform streamlines the recruitment procedure, providing a user-friendly interface for applicants to submit their information and track their application status. The website incorporates features that enhance the recruitment experience for both candidates and administrators, ensuring efficient management of applications and effective communication throughout the selection process."
	} ,
	
	{
		"id": "tandhur",
		"name" : "Tandhur",
		"client" : {
			"type_client": "freelance",
			"name": "Beehive Drones",
			"url" : "https://beehivedrones.com"
		},
		"type" : "Web",
		"language" : [{
			"name" : "Next JS",
			"color" : "#000000",
			"value" : "80"
		},{
			"name" : "Tailwind CSS",
			"color" : "#000000",
			"value" : "20"
		}],
		"date" : "2022-09-01",
		"live_url" : "https://tandhur.id",
		"thumb_photo": "/img/tandhur.png",
		"photo" : [
			"/img/tandhur.png",
			"/img/tandhur-1.png",
			"/img/tandhur-2.png",
			"/img/tandhur-3.png"
		],
		"contribution" : [
			"Designed and developed the front-end of the Tandhur web-based agricultural management system using Next.js and Tailwind CSS, ensuring that client specifications were met with high-quality and scalable solutions.",
			"Collaborated closely with the client to gather detailed project requirements, providing technical insights to enhance functionality and user experience.",
			"Built a responsive and user-friendly web application, leveraging Tailwind CSS for a modern and efficient design that ensures an intuitive user experience.",
			"Managed the front-end development lifecycle, from initial design concepts through to final deployment and ongoing support post-launch.",
			"Maintained clear and consistent communication with the client throughout the project, ensuring alignment with project goals and deliverables.",
			"Continuously implemented updates and enhancements based on client feedback and user testing, ensuring the application remained effective and user-centric."
		],
		"description" : "Tandhur is a web-based agricultural management system designed to streamline the management of agricultural sectors. The platform's primary features include the registration of farmers, categorization of crop types, tracking of farmland locations, assessment of land area, financial calculations related to agriculture, and harvest yield estimations. By providing an organized system for managing agricultural data, Tandhur aims to enhance productivity and support farmers in making informed decisions."
	}  

]
}
